Documents/Лео_ВводФактаТоварооборотаНепрямыхКлиентов/Лео_ВводФактаТоварооборотаНепрямыхКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_ВводФактаТоварооборотаНепрямыхКлиентов</name>
  <registerRecords>AccumulationRegister.Лео_ПланФактПримииНепрямымКлиентам</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Факт</name>
    <attributes>
      <name>ТорговаяТочка</name>
      <type>
        <types>CatalogRef.Лео_ТорговыеТочки</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Товарооборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированнаяСуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AccumulationRegisters/Лео_ПланФактПримииНепрямымКлиентам/Лео_ПланФактПримииНепрямымКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Лео_ПланФактПримииНепрямымКлиентам</name>
  <resources>
    <name>Товарооборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Премия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФиксированнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Documents/Лео_ВводФактаТоварооборотаНепрямыхКлиентов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Лео_ПланФактПримииНепрямымКлиентам.Записывать = Истина;
	Движения.Лео_ПланФактПримииНепрямымКлиентам.Очистить();
	
	
	ТЗ_Факт = Факт.Выгрузить(,"ТорговаяТочка, Товарооборот, Премия, ФиксированнаяСуммаПремии");
	ТЗ_Факт.Свернуть("ТорговаяТочка", "Товарооборот, Премия, ФиксированнаяСуммаПремии");
	
	
	Для Каждого ТекСтрокаФакт Из ТЗ_Факт Цикл
		Если ТекСтрокаФакт.Премия > 0 Тогда
			Движение = Движения.Лео_ПланФактПримииНепрямымКлиентам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = НачалоПериода;
			Движение.Контрагент = Контрагент;
			Движение.Сеть = Сеть;
			Движение.ТорговаяТочка = ТекСтрокаФакт.ТорговаяТочка;
			Движение.Товарооборот = ТекСтрокаФакт.Товарооборот;
			Движение.ФиксированнаяСумма = ТекСтрокаФакт.ФиксированнаяСуммаПремии;
			Движение.Премия = ТекСтрокаФакт.Премия;	
		КонецЕсли;
	КонецЦикла;
	
	КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Ответственный = Справочники.Пользователи.ПустаяСсылка() Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры
